## Individual Project - Python WEEK 4
## Victor Nyarko Anim

In [90]:
# importing libaries

import pandas as pd
import numpy as np

## Creating a Dataframe from the list of dictionaries below

In [91]:
#Naming the list of dictionaries as tech_prod

store=[{'product_id':23, 'name':'computer','wholesale_price':500, 'retail_price':1000, 'sales':100},
           {'product_id':96, 'name':'Python Workout','wholesale_price':35, 'retail_price':75, 'sales':1000},
          {'product_id':97, 'name':'Pandas Workout', 'wholesale_price':35, 'retail_price':75, 'sales':500},
           {'product_id':15, 'name':'banana', 'wholesale_price':0.5, 'retail_price':1, 'sales':200},
           {'product_id':87, 'name':'sandwitch', 'wholesale_price':3, 'retail_price':5, 'sales':300}]

In [92]:
#converting to Dataframe
store_df=pd.DataFrame(store)

In [93]:
store_df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87       sandwitch              3.0             5    300

## Calculating the total profit for each product

In [94]:
'''
    Calculating Total profit for each product using the following formula
    net_revenue_per_product = (retail_price - wholesale_price)*sales
'''

store_df['net_revenue_per_product'] = (store_df['retail_price'] - store_df['wholesale_price'])*store_df['sales']

In [95]:
store_df

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwitch,3.0,5,300,600.0

### Total net revenue

In [96]:
# using the sum method to calculate the total net revenue

Total_net_revenue = store_df['net_revenue_per_product'].sum()
Total_net_revenue

110700.0

    - The Total net revenue is $110,700.00

### Product with retail price twice wholesale price

In [97]:
# using comparison operator (>) to check product with retail price more than twice wholesale price

prod_2x_wp=store_df[tech_prod_df['retail_price'] > store_df['wholesale_price']*2]['name']
prod_2x_wp

1    Python Workout
2    Pandas Workout
Name: name, dtype: object

Products with product retail prices more than twice their wholesale prices are
    
        - Python Workout
        - Pandas Workout

### Comparing revenue the store made from food to computers and books

In [98]:
# checking how much revenue the store made from banana 

rev_bana=store_df.loc[(store_df['name']=='banana')]['net_revenue_per_product'] 
rev_bana

3    100.0
Name: net_revenue_per_product, dtype: float64

    - $100 was the revenue made from banana

In [99]:
# checking how much revenue the store made from Sandwitch

rev_sand=store_df.loc[(store_df['name']=='sandwitch')]['net_revenue_per_product']
rev_sand

4    600.0
Name: net_revenue_per_product, dtype: float64

    - $600 was the revenue made from banana

In [100]:
# adding revenue from banana and revenue from sandwitch
rev_food=(rev_bana.add(rev_sand, fill_value=0)).sum()
rev_food

700.0

    - $700.0 was the revenue made from food

In [101]:
# checking how much revenue the store made from Computer

rev_comp= store_df[(store_df['name']=='computer')]['net_revenue_per_product']
rev_comp

0    50000.0
Name: net_revenue_per_product, dtype: float64

    - $50,000.00 was the revenue made from computer

In [102]:
# checking how much revenue the store made from Python workout

rev_pyw= store_df[(store_df['name']=='Python Workout')]['net_revenue_per_product']
rev_pyw

1    40000.0
Name: net_revenue_per_product, dtype: float64

 - $40,000.00 was the revenue made from Python Workout

In [103]:
# checking how much revenue the store made from Pandas workout

rev_pdw= store_df[(store_df['name']=='Pandas Workout')]['net_revenue_per_product']
rev_pdw

2    20000.0
Name: net_revenue_per_product, dtype: float64

    - $20,000.00 was the revenue made from Pandas Workout

In [104]:
# adding revenue from Python Workout and revenue from Pandas Workout

rev_books=(rev_pyw.add(rev_pdw, fill_value=0)).sum()
rev_books

60000.0

    - $60,000.00 was the revenue made from books

### The store made

    - $700.00 revenue from food
    
    - $50,000 revenue from computer
    
    - $60,000 revenue from books

Books generated the highest revenue, followed by computer and food generated the lowest revenue.

## Applying 30% discount to the wholesale price

In [105]:
# Creating a copy of store_df

store_df_disc=store_df.copy()

store_df_disc

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwitch,3.0,5,300,600.0

In [106]:
#Applying 30% discount to wholesale price

store_df_disc['wholesale_price']=store_df_disc['wholesale_price']*0.70

store_df_disc

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,350.00,1000,100,50000.0
1,96,Python Workout,24.50,75,1000,40000.0
2,97,Pandas Workout,24.50,75,500,20000.0
3,15,banana,0.35,1,200,100.0
4,87,sandwitch,2.10,5,300,600.0

In [107]:
# Recalculating net revenue after 30% discount of wholesale prices

store_df_disc['net_revenue_per_product'] = (store_df_disc['retail_price'] - store_df_disc['wholesale_price'])*store_df_disc['sales']

store_df_disc

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,350.00,1000,100,65000.0
1,96,Python Workout,24.50,75,1000,50500.0
2,97,Pandas Workout,24.50,75,500,25250.0
3,15,banana,0.35,1,200,130.0
4,87,sandwitch,2.10,5,300,870.0

In [108]:
# using the sum method to calculate the total net revenue

New_Total_net_revenue = store_df_disc['net_revenue_per_product'].sum()
New_Total_net_revenue

141750.0

     - The new net revenue is $141,750.00 after 30% discount of wholesale prices

## Calculating Net Revenue after applying sales tax

In [115]:
#Creating a copy of df 

store_df_tax=store_df.copy()
store_df_tax

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwitch,3.0,5,300,600.0

### Calculating net revenue for tax rate of 15 percent

In [117]:
# adding income column after 15% tax

store_df_tax['income_tax_15']=store_df_tax['net_revenue_per_product']-store_df_tax['net_revenue_per_product']*0.15

store_df_tax

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,income_tax_15
0,23,computer,500.0,1000,100,50000.0,42500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0
3,15,banana,0.5,1,200,100.0,85.0
4,87,sandwitch,3.0,5,300,600.0,510.0

In [119]:
# Calculating tota net revenue after 15% tax

store_df_tax['income_tax_15'].sum()

94095.0

    - $94,095.0 is the net revenue after 15% tax

### Calculating net revenue for tax rate of 20 percent

In [120]:
# adding income column after 20% tax

store_df_tax['income_tax_20']=store_df_tax['net_revenue_per_product']-store_df_tax['net_revenue_per_product']*0.20

store_df_tax

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,income_tax_15,income_tax_20
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0
4,87,sandwitch,3.0,5,300,600.0,510.0,480.0

In [121]:
# Calculating tota net revenue after 20% tax

store_df_tax['income_tax_20'].sum()

88560.0

     - $88,560.0 is the net revenue after 20% tax

### Calculating net revenue for tax rate of 25 percent

In [122]:
# adding income column after 25% tax

store_df_tax['income_tax_25']=store_df_tax['net_revenue_per_product']-store_df_tax['net_revenue_per_product']*0.25

store_df_tax

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,income_tax_15,income_tax_20,income_tax_25
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwitch,3.0,5,300,600.0,510.0,480.0,450.0

In [123]:
# Calculating tota net revenue after 25% tax

store_df_tax['income_tax_25'].sum()

83025.0

    - $83,025.0 is the net revenue after 25% tax